99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi_capabilities.c
#include "esp32_mquickjs_wifi.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
#include "esp32_mquickjs_core.h"
#include "esp_system.h"
#include "esp32_mquickjs_wifi_config_fields.h"
#include <string.h>

static JSValue wifi_capability_strings(JSContext *ctx, const char *const *values, size_t count)
{
    JSGCRef array_ref, item_ref;
    JSValue *array = JS_PushGCRef(ctx, &array_ref);
    JSValue *item = JS_PushGCRef(ctx, &item_ref);
    *array = JS_NewArray(ctx, 0);
    if (JS_IsException(*array)) goto fail;
    for (size_t i = 0; i < count; ++i) {
        *item = JS_NewString(ctx, values[i]);
        if (JS_IsException(*item) ||
            JS_IsException(JS_SetPropertyUint32(ctx, *array, i, *item))) goto fail;
    }
    JS_PopGCRef(ctx, &item_ref);
    return JS_PopGCRef(ctx, &array_ref);
fail:
    JS_PopGCRef(ctx, &item_ref);
    JS_PopGCRef(ctx, &array_ref);
    return JS_EXCEPTION;
}

static JSValue wifi_station_capabilities(JSContext *ctx)
{
    static const struct { const char *name; bool available; } flags[] = {
        {"binarySsid", true}, {"driver", true}, {"listenInterval", true}, {"failureRetryCount", true},
#if CONFIG_SOC_WIFI_SUPPORT_5G
        {"rssi5gAdjustment", true},
#else
        {"rssi5gAdjustment", false},
#endif
#if CONFIG_SOC_WIFI_HE_SUPPORT
        {"he", true},
#else
        {"he", false},
#endif
#if CONFIG_SOC_WIFI_SUPPORT_5G
        {"vht", true},
#else
        {"vht", false},
#endif
#if CONFIG_ESP_WIFI_ENABLE_WPA3_SAE || CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA
        {"transitionDisable", true},
#else
        {"transitionDisable", false},
#endif
#if CONFIG_ESP_WIFI_WPA3_COMPATIBLE_SUPPORT
        {"disableWpa3CompatibleMode", true},
#else
        {"disableWpa3CompatibleMode", false},
#endif
#if CONFIG_ESP_WIFI_11KV_SUPPORT && CONFIG_ESP_WIFI_RRM_SUPPORT
        {"rmEnabled", true},
#else
        {"rmEnabled", false},
#endif
#if CONFIG_ESP_WIFI_11KV_SUPPORT && CONFIG_ESP_WIFI_WNM_SUPPORT
        {"btmEnabled", true},
#else
        {"btmEnabled", false},
#endif
#if CONFIG_ESP_WIFI_MBO_SUPPORT
        {"mboEnabled", true},
#else
        {"mboEnabled", false},
#endif
#if CONFIG_ESP_WIFI_11R_SUPPORT
        {"ftEnabled", true},
#else
        {"ftEnabled", false},
#endif
#if CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA
        {"oweEnabled", true},
#else
        {"oweEnabled", false},
#endif
#if CONFIG_ESP_WIFI_ENABLE_WPA3_SAE && CONFIG_ESP_WIFI_ENABLE_SAE_H2E
        {"saeH2eIdentifier", true},
#else
        {"saeH2eIdentifier", false},
#endif
    };
    static const char *const pmf[] = {
#if CONFIG_ESP_WIFI_WPA3_COMPATIBLE_SUPPORT
        "disabled",
#endif
        "optional", "required",
    };
    static const char *const pk[] = {
        "disabled",
#if CONFIG_ESP_WIFI_ENABLE_SAE_PK
        "automatic", "only",
#endif
    };
    static const char *const pwe[] = {
#if CONFIG_ESP_WIFI_ENABLE_WPA3_SAE
        "hunting-and-pecking",
#if CONFIG_ESP_WIFI_ENABLE_SAE_H2E
        "hash-to-element", "both",
#endif
#endif
        NULL,
    };
    static const char *const auth_modes[] = {"open", "wep", "wpa", "wpa2", "wpa/wpa2",
#if CONFIG_ESP_WIFI_ENABLE_WPA3_SAE
        "wpa3", "wpa2/wpa3",
#endif
#if CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA
        "owe",
#endif
#if CONFIG_ESP_WIFI_WAPI_PSK
        "wapi",
#endif
    };
    JSGCRef result_ref, value_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *value = JS_PushGCRef(ctx, &value_ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    for (size_t i = 0; i < sizeof(flags) / sizeof(flags[0]); ++i)
        if (!esp32_mquickjs_set_property_ref(ctx, result, flags[i].name, JS_NewBool(flags[i].available))) goto fail;
    *value = wifi_capability_strings(ctx, pmf, sizeof(pmf) / sizeof(pmf[0]));
    if (JS_IsException(*value) || !esp32_mquickjs_set_property_ref(ctx, result, "pmf", *value)) goto fail;
    *value = wifi_capability_strings(ctx, pwe, sizeof(pwe) / sizeof(pwe[0]) - 1);
    if (JS_IsException(*value) || !esp32_mquickjs_set_property_ref(ctx, result, "saePwe", *value)) goto fail;
    *value = wifi_capability_strings(ctx, pk, sizeof(pk) / sizeof(pk[0]));
    if (JS_IsException(*value) || !esp32_mquickjs_set_property_ref(ctx, result, "saePkModes", *value)) goto fail;
    *value = wifi_capability_strings(ctx, auth_modes, sizeof(auth_modes) / sizeof(auth_modes[0]));
    if (JS_IsException(*value) || !esp32_mquickjs_set_property_ref(ctx, result, "minimumAuthModes", *value)) goto fail;
    JS_PopGCRef(ctx, &value_ref);
    return JS_PopGCRef(ctx, &result_ref);
fail:
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &result_ref);
    return JS_EXCEPTION;
}

static JSValue wifi_ap_capabilities(JSContext *ctx)
{
    static const struct { const char *name; bool available; } flags[] = {
#if CONFIG_ESP_WIFI_SOFTAP_SUPPORT
        {"binarySsid", true}, {"driver", true},
#else
        {"binarySsid", false}, {"driver", false},
#endif
#if CONFIG_ESP_WIFI_SOFTAP_SUPPORT && CONFIG_ESP_WIFI_ENABLE_WPA3_SAE && CONFIG_ESP_WIFI_SOFTAP_SAE_SUPPORT && CONFIG_SOC_WIFI_GCMP_SUPPORT && CONFIG_ESP_WIFI_GCMP_SUPPORT && CONFIG_ESP_WIFI_ENABLE_SAE_H2E
        {"saeExt", true},
#else
        {"saeExt", false},
#endif
#if CONFIG_ESP_WIFI_SOFTAP_SUPPORT && CONFIG_ESP_WIFI_ENABLE_WPA3_SAE && CONFIG_ESP_WIFI_SOFTAP_SAE_SUPPORT && CONFIG_ESP_WIFI_WPA3_COMPATIBLE_SUPPORT
        {"wpa3CompatibleMode", true},
#else
        {"wpa3CompatibleMode", false},
#endif
#if CONFIG_ESP_WIFI_SOFTAP_SUPPORT && CONFIG_ESP_WIFI_BSS_MAX_IDLE_SUPPORT
        {"bssMaxIdle", true},
#else
        {"bssMaxIdle", false},
#endif
    };
    static const char *const modes[] = {
#if CONFIG_ESP_WIFI_SOFTAP_SUPPORT
        "open", "wpa", "wpa2", "wpa/wpa2",
#if CONFIG_ESP_WIFI_ENABLE_WPA3_SAE && CONFIG_ESP_WIFI_SOFTAP_SAE_SUPPORT
        "wpa3", "wpa2/wpa3",
#endif
#if CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_SOFTAP
        "owe",
#endif
#endif
        NULL,
    };
    static const char *const ciphers[] = {
#if CONFIG_ESP_WIFI_SOFTAP_SUPPORT
        "tkip", "ccmp", "tkip/ccmp",
#if CONFIG_ESP_WIFI_GCMP_SUPPORT
        "gcmp", "gcmp-256",
#endif
#endif
        NULL,
    };
    static const char *const pmf[] = {
#if CONFIG_ESP_WIFI_SOFTAP_SUPPORT
        "optional", "required", "disabled",
#endif
        NULL,
    };
    static const char *const pwe[] = {
#if CONFIG_ESP_WIFI_SOFTAP_SUPPORT && CONFIG_ESP_WIFI_ENABLE_WPA3_SAE && CONFIG_ESP_WIFI_SOFTAP_SAE_SUPPORT
        "hunting-and-pecking",
#if CONFIG_ESP_WIFI_ENABLE_SAE_H2E
        "hash-to-element", "both",
#endif
#endif
        NULL,
    };
    JSGCRef result_ref, value_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *value = JS_PushGCRef(ctx, &value_ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    for (size_t i = 0; i < sizeof(flags) / sizeof(flags[0]); ++i)
        if (!esp32_mquickjs_set_property_ref(ctx, result, flags[i].name, JS_NewBool(flags[i].available))) goto fail;
    *value = wifi_capability_strings(ctx, modes, sizeof(modes) / sizeof(modes[0]) - 1);
    if (JS_IsException(*value) || !esp32_mquickjs_set_property_ref(ctx, result, "authModes", *value)) goto fail;
    *value = wifi_capability_strings(ctx, ciphers, sizeof(ciphers) / sizeof(ciphers[0]) - 1);
    if (JS_IsException(*value) || !esp32_mquickjs_set_property_ref(ctx, result, "pairwiseCiphers", *value)) goto fail;
    *value = wifi_capability_strings(ctx, pmf, sizeof(pmf) / sizeof(pmf[0]) - 1);
    if (JS_IsException(*value) || !esp32_mquickjs_set_property_ref(ctx, result, "pmf", *value)) goto fail;
    *value = wifi_capability_strings(ctx, pwe, sizeof(pwe) / sizeof(pwe[0]) - 1);
    if (JS_IsException(*value) || !esp32_mquickjs_set_property_ref(ctx, result, "saePwe", *value)) goto fail;
    if (!esp32_mquickjs_set_property_ref(ctx, result, "beaconIntervalQuantumMs",
            JS_NewFloat64(ctx, ESP32_MQUICKJS_WIFI_AP_BEACON_QUANTUM_TU * 1.024)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "maximumBeaconIntervalMs",
            JS_NewFloat64(ctx, ESP32_MQUICKJS_WIFI_AP_BEACON_MAX_TU * 1.024)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "maximumDtimPeriod", JS_NewUint32(ctx, ESP32_MQUICKJS_WIFI_AP_DTIM_MAX)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "ftmResponder",
#if CONFIG_ESP_WIFI_SOFTAP_SUPPORT && CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_RESPONDER_SUPPORT
            JS_TRUE
#else
            JS_FALSE
#endif
        )) goto fail;
    JS_PopGCRef(ctx, &value_ref);
    return JS_PopGCRef(ctx, &result_ref);
fail:
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &result_ref);
    return JS_EXCEPTION;
}

